from enum import StrEnum, auto
from random import choice


class AnswerTypes(StrEnum):
    TOO_SHORT_TEXT = auto()
    TOO_MANY_WORDS = auto()
    ERROR_MESSAGE = auto()
    NO_RESULTS_FOUND = auto()
    SUCCESSFUL_SEARCH = auto()


class MessageAnswers:
    too_short_text = [
        "Будь ласка, напишіть більше деталей.",
        "Трохи більше інформації буде корисною.",
        "Можливо, трохи деталізувати?",
        "Потрібно трохи більше інформації.",
        "Додайте трошки контексту, будь ласка.",
    ]
    too_many_words = [
        "Спробуйте сформулювати коротше. До трьох слів.",
        "Можливо, скоротити трохи текст? 1-2 слова буде достатньо.",
        "Занадто багато слів, спробуйте стиснути.",
        "Многа букав ніасіліл.?",
    ]
    error_message = [
        "Сталась якась халепа, спробуйте пізніше :(",
        "Вибачте, сталася помилка, спробуйте знову пізніше :(",
        "На жаль, щось пішло не так, спробуйте пізніше :(",
        "Помилка, спробуйте пізніше або зверніться за допомогою.",
        "Щось пішло не так, спробуйте знову трохи пізніше :(",
        "На жаль, виникла помилка, спробуйте інший запит :(",
    ]
    no_results_found = [
        "На жаль, нічого не знайдено за вашим запитом :(",
        "Результатів немає, спробуйте змінити запит.",
        "По вашому запиту нічого не знайдено.",
        "Мені не вдалось нічого знайти :(",
        "Пошук не дав результатів, спробуйте інший запит.",
    ]
    successful_search = [
        "Ось що вдалося знайти:",
        "Ваші результати пошуку:",
        "Я пошукав, ось результати:",
        "Успішний пошук дав такі результати:",
        "Ось що я знайшов, підійде?",
    ]

    @classmethod
    def answer(cls, answer_type):
        if hasattr(cls, answer_type):
            answer_list = getattr(cls, answer_type)
            return choice(answer_list)
